/* --------------------------------------------------------------------------- */
// КОНСТАНТЫ
//--------------------------------------------------
//window.ANYTHING         = '---что-угодно-вообще---';
window.ANYTHING         = 'что---угодно---вообще';
//----------
window.for_description  = 'для описания';
window.for_container    = 'для содержимого';
//----------
window.ForAll   = 'A';
window.ForChars = 'C';
window.ForItems = 'I';
//----------
/* --------------------------------------------------------------------------- */
