/* ---------------------------------------------------------------------------
    TO-DO
    
--------------------------------------------------------------------------- */
// ПРЕДЛОГИ
    Предлог(['без', 'безо'], ['Р'], ['#чего']);
    Предлог(['в', 'во'], ['В', 'П'], ['#что', '#чём', '#откуда']);
    Предлог(['взамен'], ['Р'], ['#чего']);
    Предлог(['вместо'], ['Р'], ['#чего']);
    Предлог(['вне'], ['Р'], ['#чего']);
    Предлог(['для'], ['Р'], ['#чего']);
    Предлог(['до'], ['Р'], ['#чего']);
    Предлог(['за'], ['В', 'Т'], ['#что', '#чем', '#откуда']);
    Предлог(['из', 'изо'], ['Р'], ['#чего', '#откуда']);
    Предлог(['из-за'], ['Р'], ['#чего', '#откуда']);
    Предлог(['из-под'], ['Р'], ['#чего', '#откуда']);
    Предлог(['к', 'ко'], ['Д'], ['#чему']);
    Предлог(['между', 'меж'], ['Р', 'Т'], ['#чего', '#чем', '#откуда']);
    Предлог(['на'], ['В', 'П'], ['#что', '#чём']);
    Предлог(['над', 'надо'], ['Т'], ['#чем', '#откуда']);
    Предлог(['о', 'об', 'обо'], ['В', 'П'], ['#что', '#чём']);
    Предлог(['от', 'ото'], ['Р'], ['#чего']);
    Предлог(['перед', 'передо', 'пред', 'предо'], ['Т'], ['#чем', '#откуда']);
    Предлог(['по'], ['Д'], ['#чему']);
    Предлог(['под', 'подо'], ['В', 'Т'], ['#что', '#чем', '#откуда']);
    Предлог(['про'], ['В'], ['#что']);
    Предлог(['с', 'со'], ['Р', 'Т'], ['#чего', '#чем']);
    Предлог(['у'], ['Р'], ['#чего', '#откуда']);
    Предлог(['через', 'чрез'], ['В'], ['#что']);
    //----------
    Предлог(['такой', 'такая', 'такое', 'такие'], ['И'], ['#что']); // +++ для обеспечения команды "кто такой" / "что такое"
/* --------------------------------------------------------------------------- */
// НАРЕЧИЯ
    //----------
    Наречие(['аккуратно'], ['#как']);
    Наречие(['быстро'], ['#как']);
    Наречие(['вблизи', 'близ'], ['#где'], ['Р'], ['#чего']);
    Наречие(['вбок'], ['#куда']);
    Наречие(['вброд'], ['#как']);
    Наречие(['вверх'], ['#куда']);
    Наречие(['вверху'], ['#где']);
    Наречие(['ввысь'], ['#куда']);
    Наречие(['вглубь'], ['#куда']);
    Наречие(['вдаль'], ['#куда']);
    Наречие(['вдоль'], ['#где'], ['Р'], ['#чего']);
    Наречие(['вдребезги'], ['#как']);
    Наречие(['вместе'], ['#как']);
    Наречие(['вниз'], ['#куда']);
    Наречие(['внизу'], ['#где'], ['Р'], ['#чего', '#откуда']);
    Наречие(['внутри'], ['#где'], ['Р'], ['#чего', '#откуда']);
    Наречие(['внутрь'], ['#куда'], ['Р'], ['#чего']);
    Наречие(['вовне'], ['#где']);
    Наречие(['возле'], ['#где'], ['Р'], ['#чего']);
    Наречие(['вокруг'], ['#где'], ['Р'], ['#чего']);
    Наречие(['впереди'], ['#где'], ['Р'], ['#чего', '#откуда']);
    Наречие(['вперёд', 'вперед-'], ['#куда'], ['Р'], ['#чего']);
    Наречие(['вплавь'], ['#как']);
    Наречие(['вскачь'], ['#как']);
    Наречие(['вскользь'], ['#как']);
    Наречие(['вслед'], ['#как'], ['Д'], ['#чему']);
    Наречие(['вслух'], ['#как']);
    Наречие(['всмятку'], ['#как']);
    Наречие(['второпях'], ['#как']);
    Наречие(['далее'], ['#куда']);
    Наречие(['дальше'], ['#куда']);
    Наречие(['доверху'], ['#как']);
    Наречие(['донизу'], ['#как']);
    Наречие(['издали'], ['#где']);
    Наречие(['изнутри'], ['#где'], ['Р'], ['#чего', '#откуда']);
    Наречие(['кверху'], ['#куда']);
    Наречие(['книзу'], ['#куда']);
    Наречие(['мимо'], ['#куда'], ['Р'], ['#чего']);
    Наречие(['набок'], ['#как']);
    Наречие(['наверх'], ['#куда']);
    Наречие(['наверху'], ['#где']);
    Наречие(['навзничь'], ['#как']);
    Наречие(['навстречу'], ['#куда'], ['Д'], ['#чему']);
    Наречие(['навыворот'], ['#как']);
    Наречие(['навыпуск'], ['#как']);
    Наречие(['навытяжку'], ['#как']);
    Наречие(['наготове'], ['#как']);
    Наречие(['назад'], ['#куда']);
    Наречие(['назло'], ['#как'], ['Д'], ['#чему']);
    Наречие(['наизнанку'], ['#как']);
    Наречие(['наискосок'], ['#как']);
    Наречие(['наискось'], ['#как']);
    Наречие(['наоборот'], ['#как']);
    Наречие(['наобум'], ['#как']);
    Наречие(['наотмашь'], ['#как']);
    Наречие(['наотрез'], ['#как']);
    Наречие(['наперекор'], ['#как']);
    Наречие(['наперерез'], ['#как']);
    Наречие(['наповал'], ['#как']);
    Наречие(['напоказ'], ['#как']);
    Наречие(['наполовину'], ['#как']);
    Наречие(['напролом'], ['#как']);
    Наречие(['напрямик'], ['#куда']);
    Наречие(['нараспашку'], ['#как']);
    Наречие(['наружу'], ['#куда']);
    Наречие(['наскоро'], ['#как']);
    Наречие(['наспех'], ['#как']);
    Наречие(['настежь'], ['#как']);
    Наречие(['наугад'], ['#как']);
    Наречие(['наудачу'], ['#как']);
    Наречие(['наутёк', 'наутек-'], ['#куда']);
    Наречие(['начеку'], ['#как']);
    Наречие(['невпопад'], ['#как']);
    Наречие(['неподалёку', 'неподалеку-'], ['#где']);
    Наречие(['оземь'], ['#как']);
    Наречие(['около'], ['#где'], ['Р'], ['#чего']);
    Наречие(['поблизости'], ['#где']);
    Наречие(['поверху', 'поверх'], ['#где'], ['Р'], ['#чего']);
    Наречие(['позади'], ['#где'], ['Р'], ['#чего']);
    Наречие(['понемногу'], ['#как']);
    Наречие(['поодаль'], ['#где']);
    Наречие(['поперёк', 'поперек-'], ['#как'], ['Р'], ['#чего']);
    Наречие(['пополам'], ['#как']);
    Наречие(['порознь'], ['#как']);
    Наречие(['посередине'], ['#где']);
    Наречие(['после'], ['#где'], ['Р'], ['#чего']);
    Наречие(['посреди', 'среди', 'средь'], ['#где'], ['Р'], ['#чего']);
    Наречие(['рядом'], ['#где']);
    Наречие(['сбоку'], ['#где']);
    Наречие(['сверху'], ['#где']);
    Наречие(['сзади'], ['#где'], ['Р'], ['#чего', '#откуда']);
    Наречие(['сквозь'], ['#как'], ['В'], ['#что']);
    Наречие(['слева'], ['#где']);
    Наречие(['снаружи'], ['#где'], ['Р'], ['#чего']);
    Наречие(['снизу'], ['#где'], ['Р'], ['#чего', '#откуда']);
    Наречие(['спереди'], ['#где'], ['Р'], ['#чего', '#откуда']);
/* --------------------------------------------------------------------------- */
// МЕСТОИМЕНИЯ
    Местоимение('она','Ж',[
        ['она', 'И','е'],
        ['её',  'Р','е'], ['ее-',   'Р','е'],
        ['ней', 'Д','е'],
        ['её',  'В','е'], ['ее-',   'В','е'],
        ['ею',  'Т','е'],
        ['ней', 'П','е']]);
    //----------
    Местоимение('он','М',[
        ['он',      'И','е'],
        ['его',     'Р','е'],
        ['нему',    'Д','е'],
        ['его',     'В','е'],
        ['им',      'Т','е'],
        ['нём',     'П','е']]);
    //----------
    Местоимение('они','М',[
        ['они',     'И','м'],
        ['их',      'Р','м'],
        ['ним',     'Д','м'],
        ['их',      'В','м'],
        ['ими',     'Т','м'],
        ['них',     'П','м']]);
    //----------
    Местоимение('любой','М',[
        ['любой',   'И','е'], ['любй',  'И','м'],
        ['любого',  'Р','е'], ['любой', 'Р','м'],
        ['любому',  'Д','е'], ['любой', 'Д','м'],
        ['любого',  'В','е'], ['любой', 'В','м'],
        ['любым',   'Т','е'], ['любой', 'Т','м'],
        ['любом',   'П','е'], ['любой', 'П','м'],
        ]);
    //----------
    Местоимение('любая','Ж',[
        ['любая',   'И','е'],
        ['любой',   'Р','е'],
        ['любой',   'Д','е'],
        ['любую',   'В','е'],
        ['любой',   'Т','е'],
        ['любой',   'П','е'],
        ]);
    //----------
    Местоимение('любые','М',[
        ['любые',   'И','м'],
        ['любыми',  'Р','м'],
        ['любым',   'Д','м'],
        ['любых',   'В','м'],
        ['любыми',  'Т','м'],
        ['любых',   'П','м'],
        ]);
    //----------
    Местоимение('всё','С',[
        ['всё',     'И','е'], ['все',   'И','м'],
        ['всего',   'Р','е'], ['всех',  'Р','м'],
        ['всему',   'Д','е'], ['всем',  'Д','м'],
        ['всё',     'В','е'], ['всех',  'В','м'],
        ['всем',    'Т','е'], ['всеми', 'Т','м'],
        ['всём',    'П','е'], ['всех',  'П','м'],
        ['все',     'И','е'],
        ['все',     'В','е'],
        ['всем',    'П','е'],
        ]);
    //----------
/* --------------------------------------------------------------------------- */
// СУЩЕСТВИТЕЛЬНЫЕ
    //----------
    Существительное('я','М',[
        ['я',       'И','е'], ['мы',    'И','м'],
        ['меня',    'Р','е'], ['нас',   'Р','м'],
        ['мне',     'Д','е'], ['нам',   'Д','м'],
        ['меня',    'В','е'], ['нас',   'В','м'],
        ['мной',    'Т','е'], ['нами',  'Т','м'],
        ['мне',     'П','е'], ['нас',   'П','м'],
        //----------
        ['себя',    'Р','е'],
        ['себя',    'В','е'],
        ['мною',    'Т','е'],
        ['себе',    'Д','е'],
        ]);
    //----------
    Существительное('пират','М',[
        ['пират',   'И','е'], ['пираты',   'И','м'],
        ['пирата',  'Р','е'], ['пиратов',  'Р','м'],
        ['пирату',  'Д','е'], ['пиратам',  'Д','м'],
        ['пирата',  'В','е'], ['пиратов',  'В','м'],
        ['пиратом', 'Т','е'], ['пиратами', 'Т','м'],
        ['пирате',  'П','е'], ['пиратах',  'П','м'],
        //----------
        ]);
    //----------
    Существительное('берег','М',[
        ['берег',   'И','е'], ['берега',    'И','м'],
        ['берега',  'Р','е'], ['берегов',   'Р','м'],
        ['берегу',  'Д','е'], ['берегам',   'Д','м'],
        ['берег',   'В','е'], ['берега',    'В','м'],
        ['берегом', 'Т','е'], ['берегами',  'Т','м'],
        ['береге',  'П','е'], ['берегах',   'П','м'],
        ['берегу',  'П','е']
        //----------
        ]);
    //----------
    Существительное('побережье','С',[
        ['побережье',  'И','е'], ['побережья',   'И','м'],
        ['побережья',  'Р','е'], ['побережей',   'Р','м'],
        ['побережью',  'Д','е'], ['побережьям',  'Д','м'],
        ['побережье',  'В','е'], ['побережья',   'В','м'],
        ['побережьем', 'Т','е'], ['побережьями', 'Т','м'],
        ['побережье',  'П','е'], ['побережьях',  'П','м'],
        //----------
        ]);
    //----------
    Существительное('пистолет','М',[
        ['пистолет',    'И','е'], ['пистолеты',     'И','м'],
        ['пистолета',   'Р','е'], ['пистолетов',    'Р','м'],
        ['пистолету',   'Д','е'], ['пистолетам',    'Д','м'],
        ['пистолет',    'В','е'], ['пистолеты',    'В','м'],
        ['пистолетом',  'Т','е'], ['пистолетами',   'Т','м'],
        ['пистолете',   'П','е'], ['пистолетах',    'П','м'],
        //----------
        ]);
    //----------
    Существительное('помощь','Ж',[
        ['помощь',  'И','е'],
        ['помощи',  'Р','е'],
        ['помощи',  'Д','е'],
        ['помощь',  'В','е'],
        ['помощью', 'Т','е'],
        ['помощи',  'П','е'],
        //----------
        ]);
    //----------
    Существительное('справка','Ж',[
        ['справка',  'И','е'], ['справки',   'И','м'],
        ['справки',  'Р','е'], ['справок',   'Р','м'],
        ['справке',  'Д','е'], ['справкам',  'Д','м'],
        ['справку',  'В','е'], ['справки',   'В','м'],
        ['справкой', 'Т','е'], ['справками', 'Т','м'],
        ['справке',  'П','е'], ['справках',  'П','м'],
        //----------
        ]);
    //----------
    Существительное('водоросли','Ж',[
        ['водоросль',  'И','е'], ['водоросли',   'И','м'],
        ['водоросли',  'Р','е'], ['водорослей',  'Р','м'],
        ['водоросли',  'Д','е'], ['водоросли',   'Д','м'],
        ['водоросль',  'В','е'], ['водоросли',   'В','м'],
        ['водорослью', 'Т','е'], ['водорослями', 'Т','м'],
        ['водоросле',  'П','е'], ['водорослях',  'П','м'],
        ]);
    //----------
    Существительное('инвентарь','М',[
        ['инвентарь',   'И','е'], //['инвентари',     'И','м'], Потом
        ['инвентаря',   'Р','е'], //['инвентарей',    'Р','м'],
        ['инвентарю',   'Д','е'], //['инвентарям',    'Д','м'],
        ['инвентарь',   'В','е'], //['инвентари',     'В','м'],
        ['инвентарём',  'Т','е'], //['инвентарями',   'Т','м'],
        ['инвентаре',   'П','е'], //['инвентарях',    'П','м'],
        //----------
        ['инвентарем-', 'Т','е'],
        ['инв',         'И','е'],
        ['инв',         'В','е'],
        ]);
    //----------
    Существительное('остров','М',[
        ['остров',  'И','е'], ['острова',   'И','м'],
        ['острова', 'Р','е'], ['островов',  'Р','м'],
        ['острову', 'Д','е'], ['островам',  'Д','м'],
        ['остров',  'В','е'], ['острова',   'В','м'],
        ['островом','Т','е'], ['островами', 'Т','м'],
        ['острове', 'П','е'], ['островах',  'П','м'],
        //----------
        ['островок-',   'И','е'], ['островки-',     'И','м'],
        ['островка-',   'Р','е'], ['островков-',    'Р','м'],
        ['островку-',   'Д','е'], ['островкам-',    'Д','м'],
        ['островок-',   'В','е'], ['островки-',     'В','м'],
        ['островком-',  'Т','е'], ['островками-',   'Т','м'],
        ['островке-',   'П','е'], ['островках-',    'П','м'],
        ]);
    //----------
    Существительное('океан','М',[
        ['океан',   'И','е'], ['океаны',    'И','м'],
        ['океана',  'Р','е'], ['океанов',   'Р','м'],
        ['океану',  'Д','е'], ['океанам',   'Д','м'],
        ['океан',   'В','е'], ['океаны',    'В','м'],
        ['океаном', 'Т','е'], ['океанами',  'Т','м'],
        ['океане',  'П','е'], ['океанах',   'П','м'],
        ]);
    //----------
    Существительное('море','С',[
        ['море',  'И','е'], ['моря',   'И','м'],
        ['моря',  'Р','е'], ['морей',  'Р','м'],
        ['морю',  'Д','е'], ['морям',  'Д','м'],
        ['море',  'В','е'], ['моря',   'В','м'],
        ['морем', 'Т','е'], ['морями', 'Т','м'],
        ['море',  'П','е'], ['морях',  'П','м'],
        ]);
    //----------
    Существительное('вода','Ж',[
        ['вода',  'И','е'], ['воды',   'И','м'],
        ['воды',  'Р','е'], ['вод',    'Р','м'],
        ['воде',  'Д','е'], ['водам',  'Д','м'],
        ['воду',  'В','е'], ['воды',   'В','м'],
        ['водой', 'Т','е'], ['водами', 'Т','м'],
        ['воде',  'П','е'], ['водах',  'П','м'],
        ]);
    //----------
    Существительное('пальма','Ж',[
        ['пальма',  'И','е'], ['пальмы',    'И','м'],
        ['пальмы',  'Р','е'], ['пальм',     'Р','м'],
        ['пальме',  'Д','е'], ['пальмам',   'Д','м'],
        ['пальму',  'В','е'], ['пальмы',    'В','м'],
        ['пальмой', 'Т','е'], ['пальмами',  'Т','м'],
        ['пальме',  'П','е'], ['пальмах',   'П','м'],
        ]);
    //----------
    Существительное('сторона','Ж',[
        ['сторона',     'И','е'], ['стороны',   'И','м'],
        ['стороны',     'Р','е'], ['сторон',    'Р','м'],
        ['стороне',     'Д','е'], ['сторонам',  'Д','м'],
        ['сторону',     'В','е'], ['стороны',   'В','м'],
        ['стороной',    'Т','е'], ['сторонами', 'Т','м'],
        ['стороне',     'П','е'], ['сторонах',  'П','м'],
        ]);
    //----------
    Существительное('дерево','С',[
        ['дерево',  'И','е'], ['деревья',   'И','м'],
        ['дерева',  'Р','е'], ['деревьев',  'Р','м'],
        ['дереву',  'Д','е'], ['деревьям',  'Д','м'],
        ['дерево',  'В','е'], ['деревья',   'В','м'],
        ['деревом', 'Т','е'], ['деревьями', 'Т','м'],
        ['дереве',  'П','е'], ['деревьях',  'П','м']]);
    //----------
    Существительное('яма','Ж',[
        ['яма',   'И','е'], ['ямы',    'И','м'],
        ['ямы',   'Р','е'], ['ям',     'Р','м'],
        ['яме',   'Д','е'], ['ямам',   'Д','м'],
        ['яму',   'В','е'], ['ямы',    'В','м'],
        ['ямой',  'Т','е'], ['ямами',  'Т','м'],
        ['яме',   'П','е'], ['ямах',   'П','м'],
        //----------
        ['ямка-',  'И','е'], ['ямки-',   'И','м'],
        ['ямки-',  'Р','е'], ['ямок-',   'Р','м'],
        ['ямке-',  'Д','е'], ['ямкам-',  'Д','м'],
        ['ямку-',  'В','е'], ['ямки-',   'В','м'],
        ['ямкой-', 'Т','е'], ['ямками-', 'Т','м'],
        ['ямке-',  'П','е'], ['ямках-',  'П','м'],
        ]);
    //----------
    Существительное('верёвка','Ж',[
        ['верёвка',     'И','е'], ['верёвки',   'И','м'],
        ['верёвки',     'Р','е'], ['верёвок',   'Р','м'],
        ['верёвке',     'Д','е'], ['верёвкам',  'Д','м'],
        ['верёвку',     'В','е'], ['верёвки',   'В','м'],
        ['верёвкой',    'Т','е'], ['верёвками', 'Т','м'],
        ['верёвке',     'П','е'], ['верёвках',  'П','м'],
        //----------
        ['веревка-',    'И','е'], ['веревки-',      'И','м'],
        ['веревки-',    'Р','е'], ['веревок-',      'Р','м'],
        ['веревке-',    'Д','е'], ['веревкам-',     'Д','м'],
        ['веревку-',    'В','е'], ['веревки-',      'В','м'],
        ['веревкой-',   'Т','е'], ['веревками-',    'Т','м'],
        ['веревке-',    'П','е'], ['веревках-',     'П','м']]);
    //----------
    Существительное('ворона','Ж',[
        ['ворона',  'И','е'], ['вороны',    'И','м'],
        ['вороны',  'Р','е'], ['ворон',     'Р','м'],
        ['вороне',  'Д','е'], ['воронам',   'Д','м'],
        ['ворону',  'В','е'], ['ворон',     'В','м'],
        ['вороной', 'Т','е'], ['воронами',  'Т','м'],
        ['вороне',  'П','е'], ['воронах',   'П','м']]);
    //----------
    Существительное('дверь','Ж',[
        ['дверь',   'И','е'], ['двери',     'И','м'],
        ['двери',   'Р','е'], ['дверей',    'Р','м'],
        ['двери',   'Д','е'], ['дверям',    'Д','м'],
        ['дверь',   'В','е'], ['двери',     'В','м'],
        ['дверью',  'Т','е'], ['дверьми',   'Т','м'],
        ['двери',   'П','е'], ['дверях',    'П','м']]);
    //----------
    Существительное('дом','М',[
        ['дом',     'И','е'], ['дома',      'И','м'],
        ['дома',    'Р','е'], ['домов',     'Р','м'],
        ['дому',    'Д','е'], ['домам',     'Д','м'],
        ['дом',     'В','е'], ['дома',      'В','м'],
        ['домом',   'Т','е'], ['домами',    'Т','м'],
        ['доме',    'П','е'], ['домах',     'П','м']]);
    //----------
    Существительное('животное','С',[
        ['животное',    'И','е'], ['животные',  'И','м'],
        ['животного',   'Р','е'], ['животных',  'Р','м'],
        ['животному',   'Д','е'], ['животным',  'Д','м'],
        ['животное',    'В','е'], ['животных',  'В','м'],
        ['животным',    'Т','е'], ['животными', 'Т','м'],
        ['животном',    'П','е'], ['животных',  'П','м']]);
    //----------
    Существительное('забор','М',[
        ['забор',   'И','е'], ['заборы',    'И','м'],
        ['забора',  'Р','е'], ['заборов',   'Р','м'],
        ['забору',  'Д','е'], ['заборам',   'Д','м'],
        ['забор',   'В','е'], ['заборы',    'В','м'],
        ['забором', 'Т','е'], ['заборами',  'Т','м'],
        ['заборе',  'П','е'], ['заборах',   'П','м']]);
    //----------
    Существительное('земля','Ж',[
        ['земля',   'И','е'], ['земли',     'И','м'],
        ['земли',   'Р','е'], ['земель',    'Р','м'],
        ['земле',   'Д','е'], ['землям',    'Д','м'],
        ['землю',   'В','е'], ['земли',     'В','м'],
        ['землей',  'Т','е'], ['землями',   'Т','м'],
        ['земле',   'П','е'], ['землях',    'П','м']]);
    //----------
    Существительное('грунт','М',[
        ['грунт',   'И','е'], ['грунт',    'И','м'],
        ['грунта',  'Р','е'], ['грунта',   'Р','м'],
        ['грунту',  'Д','е'], ['грунту',   'Д','м'],
        ['грунт',   'В','е'], ['грунт',    'В','м'],
        ['грунтом', 'Т','е'], ['грунтом',  'Т','м'],
        ['грунте',  'П','е'], ['грунте',   'П','м']]);
    //----------
    Существительное('игрок','М',[
        ['игрок',   'И','е'], ['игроки',    'И','м'],
        ['игрока',  'Р','е'], ['игроков',   'Р','м'],
        ['игроку',  'Д','е'], ['игрокам',   'Д','м'],
        ['игрока',  'В','е'], ['игроков',   'В','м'],
        ['игроком', 'Т','е'], ['игроками',  'Т','м'],
        ['игроке',  'П','е'], ['игроках',   'П','м']]);
    //----------
    Существительное('кинжал','М',[
        ['кинжал',      'И','е'], ['кинжалы',   'И','м'],
        ['кинжала',     'Р','е'], ['кинжалов',  'Р','м'],
        ['кинжалу',     'Д','е'], ['кинжалам',  'Д','м'],
        ['кинжал',      'В','е'], ['кинжалы',   'В','м'],
        ['кинжалом',    'Т','е'], ['кинжалами', 'Т','м'],
        ['кинжале',     'П','е'], ['кинжалах',  'П','м']]);
    //----------
    Существительное('кино','С',[
        ['кино',    'И','е'],
        ['кино',    'Р','е'],
        ['кину',    'Д','е'],
        ['кино',    'В','е'],
        ['кином',   'Т','е'],
        ['кино',    'П','е'],]);
    //----------
    Существительное('клинок','М',[
        ['клинок',  'И','е'], ['клинки',    'И','м'],
        ['клинка',  'Р','е'], ['клинков',   'Р','м'],
        ['клинку',  'Д','е'], ['клинкам',   'Д','м'],
        ['клинок',  'В','е'], ['клинки',    'В','м'],
        ['клинком', 'Т','е'], ['клинками',  'Т','м'],
        ['клинке',  'П','е'], ['клинках',   'П','м']]);
    //----------
    Существительное('сабля','Ж',[
        ['сабля',       'И','е'], ['сабли',     'И','м'],
        ['сабли',       'Р','е'], ['сабель',    'Р','м'],
        ['сабле',       'Д','е'], ['саблям',    'Д','м'],
        ['саблю',       'В','е'], ['сабли',     'В','м'],
        ['саблей',      'Т','е'], ['саблями',   'Т','м'],
        ['сабле',       'П','е'], ['саблях',    'П','м']]);
    //----------
    Существительное('комната','Ж',[
        ['комната',     'И','е'], ['комнаты',   'И','м'],
        ['комнаты',     'Р','е'], ['комнат',    'Р','м'],
        ['комнате',     'Д','е'], ['комнатам',  'Д','м'],
        ['комнату',     'В','е'], ['комнаты',   'В','м'],
        ['комнатой',    'Т','е'], ['комнатами', 'Т','м'],
        ['комнате',     'П','е'], ['комнатах',  'П','м']]);
    //----------
    Существительное('копейка','Ж',[
        ['копейка',     'И','е'], ['копейки',   'И','м'],
        ['копейки',     'Р','е'], ['копеек',    'Р','м'],
        ['копейке',     'Д','е'], ['копейкам',  'Д','м'],
        ['копейку',     'В','е'], ['копейки',   'В','м'],
        ['копейкой',    'Т','е'], ['копейками', 'Т','м'],
        ['копейке',     'П','е'], ['копейках',  'П','м']]);
    //----------
    Существительное('кошелёк','М',[
        ['кошелёк',     'И','е'], ['кошельки',      'И','м'],
        ['кошелька',    'Р','е'], ['кошельков',     'Р','м'],
        ['кошельку',    'Д','е'], ['кошелькам',     'Д','м'],
        ['кошелёк',     'В','е'], ['кошельки',      'В','м'],
        ['кошельком',   'Т','е'], ['кошельками',    'Т','м'],
        ['кошельке',    'П','е'], ['кошельках',     'П','м'],
        //----------
        ['кошелек-',    'И','е'],
        ['кошелек-',    'В','е'],
        ]);
    //----------
    Существительное('конь','М',[
        ['конь',    'И','е'], ['кони',      'И','м'],
        ['коня',    'Р','е'], ['коней',     'Р','м'],
        ['коню',    'Д','е'], ['коням',     'Д','м'],
        ['коня',    'В','е'], ['коней',     'В','м'],
        ['конём',   'Т','е'], ['конями',    'Т','м'],
        ['конях',   'П','е'], ['конях',     'П','м'],
        ['конем-',  'Т','е'], 
        ]);
    //----------
    Существительное('лошадь','Ж',[
        ['лошадь',  'И','е'], ['лошади',    'И','м'],
        ['лошади',  'Р','е'], ['лошадей',   'Р','м'],
        ['лошади',  'Д','е'], ['лошадям',   'Д','м'],
        ['лошадь',  'В','е'], ['лошадей',   'В','м'],
        ['лошадью', 'Т','е'], ['лошадьми',  'Т','м'],
        ['лошади',  'П','е'], ['лошадях',   'П','м'],
        //----------
        ['лошадка',     'И','е'], ['лошадки',   'И','м'],
        ['лошадки',     'Р','е'], ['лошадок',   'Р','м'],
        ['лошадке',     'Д','е'], ['лошадкам',  'Д','м'],
        ['лошадку',     'В','е'], ['лошадок',   'В','м'],
        ['лошадкой',    'Т','е'], ['лошадками', 'Т','м'],
        ['лошадке',     'П','е'], ['лошадках',  'П','м']]);
    //----------
    Существительное('монета','Ж',[
        ['монета',  'И','е'], ['монеты',    'И','м'],
        ['монеты',  'Р','е'], ['монет',     'Р','м'],
        ['монете',  'Д','е'], ['монетам',   'Д','м'],
        ['монету',  'В','е'], ['монеты',    'В','м'],
        ['монетой', 'Т','е'], ['монетами',  'Т','м'],
        ['монете',  'П','е'], ['монетах',   'П','м']]);
    //----------
    Существительное('нож','М',[
        ['нож',     'И','е'], ['ножи',      'И','м'],
        ['ножа',    'Р','е'], ['ножей',     'Р','м'],
        ['ножу',    'Д','е'], ['ножам',     'Д','м'],
        ['нож',     'В','е'], ['ножи',      'В','м'],
        ['ножом',   'Т','е'], ['ножами',    'Т','м'],
        ['ноже',    'П','е'], ['ножах',     'П','м']]);
    //----------
    Существительное('ограда','Ж',[
        ['ограда',  'И','е'], ['ограды',    'И','м'],
        ['ограды',  'Р','е'], ['оград',     'Р','м'],
        ['ограде',  'Д','е'], ['оградам',   'Д','м'],
        ['ограду',  'В','е'], ['ограды',    'В','м'],
        ['оградой', 'Т','е'], ['оградами',  'Т','м'],
        ['ограде',  'П','е'], ['оградах',   'П','м']]);
    //----------
    Существительное('окно','М',[
        ['окно',    'И','е'], ['окна',      'И','м'],
        ['окна',    'Р','е'], ['окон',      'Р','м'],
        ['окну',    'Д','е'], ['окнам',     'Д','м'],
        ['окно',    'В','е'], ['окна',      'В','м'],
        ['окном',   'Т','е'], ['окнами',    'Т','м'],
        ['окне',    'П','е'], ['окнах',     'П','м']]);
    //----------
    Существительное('описание','С',[
        ['описание',    'И','е'], ['описания',      'И','м'],
        ['описания',    'Р','е'], ['описаний',      'Р','м'],
        ['описанию',    'Д','е'], ['описаниям',     'Д','м'],
        ['описание',    'В','е'], ['описания',      'В','м'],
        ['описанием',   'Т','е'], ['описаниями',    'Т','м'],
        ['описании',    'П','е'], ['описаниях',     'П','м']]);
    //----------
    Существительное('песок','М',[
        ['песок',  'И','е'], ['пески',    'И','м'],
        ['песка',  'Р','е'], ['песков',   'Р','м'],
        ['песку',  'Д','е'], ['пескам',   'Д','м'],
        ['песок',  'В','е'], ['пески',    'В','м'],
        ['песком', 'Т','е'], ['песками',  'Т','м'],
        ['песке',  'П','е'], ['песках',   'П','м']]);
    //----------
    Существительное('поляна','Ж',[
        ['поляна',  'И','е'], ['поляны',    'И','м'],
        ['поляны',  'Р','е'], ['полян',     'Р','м'],
        ['поляне',  'Д','е'], ['полянам',   'Д','м'],
        ['поляну',  'В','е'], ['поляны',    'В','м'],
        ['поляной', 'Т','е'], ['полянами',  'Т','м'],
        ['поляне',  'П','е'], ['полянах',   'П','м']]);
    //----------
    Существительное('помещение','С',[
        ['помещение',   'И','е'], ['помещения',     'И','м'],
        ['помещения',   'Р','е'], ['помещений',     'Р','м'],
        ['помещению',   'Д','е'], ['помещениям',    'Д','м'],
        ['помещение',   'В','е'], ['помещения',     'В','м'],
        ['помещением',  'Т','е'], ['помещениями',   'Т','м'],
        ['помещении',   'П','е'], ['помещениях',    'П','м']]);
    //----------
    Существительное('ствол','М',[
        ['ствол',   'И','е'], ['стволы',    'И','м'],
        ['ствола',  'Р','е'], ['стволов',   'Р','м'],
        ['стволу',  'Д','е'], ['стволам',   'Д','м'],
        ['ствол',   'В','е'], ['стволы',    'В','м'],
        ['стволом', 'Т','е'], ['стволами',  'Т','м'],
        ['стволе',  'П','е'], ['стволах',   'П','м']]);
    //----------
    Существительное('скотина','Ж',[
        ['скотина',     'И','е'], ['скотина',   'И','м'],
        ['скотины',     'Р','е'], ['скотины',   'Р','м'],
        ['скотине',     'Д','е'], ['скотине',   'Д','м'],
        ['скотину',     'В','е'], ['скотину',   'В','м'],
        ['скотиной',    'Т','е'], ['скотиной',  'Т','м'],
        ['скотине',     'П','е'], ['скотине',   'П','м'],
        ]);
    //----------
    Существительное('сундук','М',[
        ['сундук',      'И','е'], ['сундуки',   'И','м'],
        ['сундука',     'Р','е'], ['сундуков',  'Р','м'],
        ['сундуку',     'Д','е'], ['сундукам',  'Д','м'],
        ['сундук',      'В','е'], ['сундуки',   'В','м'],
        ['сундуком',    'Т','е'], ['сундуками', 'Т','м'],
        ['сундуке',     'П','е'], ['сундуках',  'П','м']]);
    //----------
    Существительное('стражник','М',[
        ['стражник',    'И','е'], ['стражники',     'И','м'],
        ['стражника',   'Р','е'], ['стражников',    'Р','м'],
        ['стражнику',   'Д','е'], ['стражникам',    'Д','м'],
        ['стражника',   'В','е'], ['стражников',    'В','м'],
        ['стражником',  'Т','е'], ['стражниками',   'Т','м'],
        ['стражнике',   'П','е'], ['стражниках',    'П','м']]);
    //----------
    Существительное('ящик','М',[
        ['ящик',    'И','е'], ['ящики',     'И','м'],
        ['ящика',   'Р','е'], ['ящиков',    'Р','м'],
        ['ящику',   'Д','е'], ['ящикам',    'Д','м'],
        ['ящик',    'В','е'], ['ящики',     'В','м'],
        ['ящиком',  'Т','е'], ['ящиками',   'Т','м'],
        ['ящике',   'П','е'], ['ящиках',    'П','м']]);
    //----------
    Существительное('порох','М',[
        ['порох',    'И','е'], ['порох',     'И','м'],
        ['пороха',   'Р','е'], ['пороха',    'Р','м'],
        ['пороху',   'Д','е'], ['пороху',    'Д','м'],
        ['порох',    'В','е'], ['порох',     'В','м'],
        ['порохом',  'Т','е'], ['порохом',   'Т','м'],
        ['порохе',   'П','е'], ['порохе',    'П','м']]);
    //----------
    Существительное('пуля','Ж',[
        ['пуля',  'И','е'], ['пули',   'И','м'],
        ['пули',  'Р','е'], ['пуль',   'Р','м'],
        ['пуле',  'Д','е'], ['пулям',  'Д','м'],
        ['пулю',  'В','е'], ['пули',   'В','м'],
        ['пулей', 'Т','е'], ['пулями', 'Т','м'],
        ['пуле',  'П','е'], ['пулях',  'П','м']]);
    //----------
    Существительное('бечёвка', 'Ж', [
        ['бечёвка',  'И','е'], ['бечёвки',   'И','м'],
        ['бечёвки',  'Р','е'], ['бечёвок',   'Р','м'],
        ['бечёвке',  'Д','е'], ['бечёвкам',  'Д','м'],
        ['бечёвку',  'В','е'], ['бечёвки',   'В','м'],
        ['бечёвкой', 'Т','е'], ['бечёвками', 'Т','м'],
        ['бечёвке',  'П','е'], ['бечёвках',  'П','м'],
        //----------
        ['бечевка-',  'И','е'], ['бечевки-',   'И','м'],
        ['бечевки-',  'Р','е'], ['бечевок-',   'Р','м'],
        ['бечевке-',  'Д','е'], ['бечевкам-',  'Д','м'],
        ['бечевку-',  'В','е'], ['бечевки-',   'В','м'],
        ['бечевкой-', 'Т','е'], ['бечевками-', 'Т','м'],
        ['бечевке-',  'П','е'], ['бечевках-',  'П','м']
        ]);
    //----------
    Существительное('корабль','М',[
        ['корабль',  'И','е'], ['корабли',   'И','м'],
        ['корабля',  'Р','е'], ['кораблей',  'Р','м'],
        ['кораблю',  'Д','е'], ['кораблям',  'Д','м'],
        ['корабль',  'В','е'], ['корабли',   'В','м'],
        ['кораблём', 'Т','е'], ['кораблями', 'Т','м'],
        ['корабле',  'П','е'], ['кораблях',  'П','м'],
        ['кораблем-', 'Т','е']]);
    //----------
    Существительное('царапина','Ж',[
        ['царапина',  'И','е'], ['царапины',   'И','м'],
        ['царапины',  'Р','е'], ['царапин',    'Р','м'],
        ['царапине',  'Д','е'], ['царапинам',  'Д','м'],
        ['царапину',  'В','е'], ['царапины',   'В','м'],
        ['царапиной', 'Т','е'], ['царапинами', 'Т','м'],
        ['царапине',  'П','е'], ['царапинах',  'П','м'],
        ]);
    //----------
    Существительное('борозда','Ж',[
        ['борозда',  'И','е'], ['борозды',   'И','м'],
        ['борозды',  'Р','е'], ['борозд',    'Р','м'],
        ['борозде',  'Д','е'], ['бороздам',  'Д','м'],
        ['борозду',  'В','е'], ['борозды',   'В','м'],
        ['бороздой', 'Т','е'], ['бороздами', 'Т','м'],
        ['борозде',  'П','е'], ['бороздах',  'П','м'],
        ]);
    //----------
    Существительное('солнце','С',[
        ['солнце',  'И','е'], ['солнца',   'И','м'],
        ['солнца',  'Р','е'], ['солнц',    'Р','м'],
        ['солнцу',  'Д','е'], ['солнцам',  'Д','м'],
        ['солнце',  'В','е'], ['солнца',   'В','м'],
        ['солнцем', 'Т','е'], ['солнцами', 'Т','м'],
        ['солнце',  'П','е'], ['солнцах',  'П','м'],
        ]);
    //----------
    Существительное('кора','Ж',[
        ['кора',  'И','е'], ['кора',  'И','м'],
        ['коры',  'Р','е'], ['коры',  'Р','м'],
        ['коре',  'Д','е'], ['коре',  'Д','м'],
        ['кору',  'В','е'], ['кору',  'В','м'],
        ['корой', 'Т','е'], ['корой', 'Т','м'],
        ['коре',  'П','е'], ['коре',  'П','м'],
        ]);
    //----------
    Существительное('кольцо','С',[
        ['кольцо',  'И','е'], ['кольца',   'И','м'],
        ['кольца',  'Р','е'], ['колец',    'Р','м'],
        ['кольцу',  'Д','е'], ['кольцам',  'Д','м'],
        ['кольцо',  'В','е'], ['кольца',   'В','м'],
        ['кольцом', 'Т','е'], ['кольцами', 'Т','м'],
        ['кольце',  'П','е'], ['кольцах',  'П','м'],
        ]);
    //----------
    Существительное('замок','М',[
        ['замок',  'И','е'], ['замки',   'И','м'],
        ['замка',  'Р','е'], ['замков',  'Р','м'],
        ['замку',  'Д','е'], ['замкам',  'Д','м'],
        ['замок',  'В','е'], ['замки',   'В','м'],
        ['замком', 'Т','е'], ['замками', 'Т','м'],
        ['замке',  'П','е'], ['замках',  'П','м'],
        ]);
    //----------
    Существительное('фитиль','М',[
        ['фитиль',   'И','е'], ['фитили',   'И','м'],
        ['фитиля',   'Р','е'], ['фитилей',  'Р','м'],
        ['фитилю',   'Д','е'], ['фитилям',  'Д','м'],
        ['фитиль',   'В','е'], ['фитили',   'В','м'],
        ['фитилём',  'Т','е'], ['фитилями', 'Т','м'],
        ['фитиле',   'П','е'], ['фитилях',  'П','м'],
        ['фитилем-', 'Т','е']
        ]);
    //----------
    Существительное('мешок','М',[
        ['мешок',   'И','е'], ['мешки',   'И','м'],
        ['мешка',   'Р','е'], ['мешков',  'Р','м'],
        ['мешку',   'Д','е'], ['мешкам',  'Д','м'],
        ['мешок',   'В','е'], ['мешки',   'В','м'],
        ['мешком',  'Т','е'], ['мешками', 'Т','м'],
        ['мешок',   'П','е'], ['мешках',  'П','м'],
        //----------
        ['мешочек-',  'И','е'], ['мешочки-',   'И','м'],
        ['мешочка-',  'Р','е'], ['мешочков-',  'Р','м'],
        ['мешочку-',  'Д','е'], ['мешочкам-',  'Д','м'],
        ['мешочек-',  'В','е'], ['мешочки-',   'В','м'],
        ['мешочком-', 'Т','е'], ['мешочками-', 'Т','м'],
        ['мешочке-',  'П','е'], ['мешочках-',  'П','м'],
        ]);
    //----------
    Существительное('огниво','С',[
        ['огниво',  'И','е'],
        ['огнива',  'Р','е'],
        ['огниву',  'Д','е'],
        ['огниво',  'В','е'],
        ['огнивом', 'Т','е'],
        ['огниве',  'П','е'],
        ]);
    //----------
    Существительное('зажигалка','Ж',[
        ['зажигалка',   'И','е'], ['зажигалки',   'И','м'],
        ['зажигалки',   'Р','е'], ['зажигалок',   'Р','м'],
        ['зажигалке',   'Д','е'], ['зажигалкам',  'Д','м'],
        ['зажигалку',   'В','е'], ['зажигалки',   'В','м'],
        ['зажигалкой',  'Т','е'], ['зажигалками', 'Т','м'],
        ['зажигалке',   'П','е'], ['зажигалках',  'П','м'],
        ]);
    //----------
    Существительное('кусок','М',[
        ['кусок',  'И','е'], ['куски',   'И','м'],
        ['куска',  'Р','е'], ['кусков',  'Р','м'],
        ['куску',  'Д','е'], ['кускам',  'Д','м'],
        ['кусок',  'В','е'], ['куски',   'В','м'],
        ['куском', 'Т','е'], ['кусками', 'Т','м'],
        ['куске',  'П','е'], ['кусках',  'П','м'],
        //----------
        ['кусочек-',  'И','е'], ['кусочки-',   'И','м'],
        ['кусочка-',  'Р','е'], ['кусочков-',  'Р','м'],
        ['кусочку-',  'Д','е'], ['кусочкам-',  'Д','м'],
        ['кусочек-',  'В','е'], ['кусочки-',   'В','м'],
        ['кусочком-', 'Т','е'], ['кусочками-', 'Т','м'],
        ['кусочке-',  'П','е'], ['кусочках-',  'П','м'],
        ]);
    //----------
    Существительное('часть','Ж',[
        ['часть',  'И','е'], ['части',   'И','м'],
        ['части',  'Р','е'], ['частей',  'Р','м'],
        ['части',  'Д','е'], ['частям',  'Д','м'],
        ['часть',  'В','е'], ['части',   'В','м'],
        ['частью', 'Т','е'], ['частями', 'Т','м'],
        ['части',  'П','е'], ['частях',  'П','м'],
        ]);
    //----------
    Существительное('тень','Ж',[
        ['тень',  'И','е'], ['тени',   'И','м'],
        ['тени',  'Р','е'], ['теней',  'Р','м'],
        ['тени',  'Д','е'], ['теням',  'Д','м'],
        ['тень',  'В','е'], ['тени',   'В','м'],
        ['тенью', 'Т','е'], ['тенями', 'Т','м'],
        ['тени',  'П','е'], ['тенях',  'П','м'],
        ]);
    //----------
    Существительное('крышка','Ж',[
        ['крышка',  'И','е'], ['крышки',   'И','м'],
        ['крышки',  'Р','е'], ['крышек',   'Р','м'],
        ['крышке',  'Д','е'], ['крышкам',  'Д','м'],
        ['крышку',  'В','е'], ['крышки',   'В','м'],
        ['крышкой', 'Т','е'], ['крышками', 'Т','м'],
        ['крышке',  'П','е'], ['крышках',  'П','м'],
        ]);
    //----------
    Существительное('бумага','Ж',[
        ['бумага',  'И','е'], ['бумаги',   'И','м'],
        ['бумаги',  'Р','е'], ['бумаг',    'Р','м'],
        ['бумаге',  'Д','е'], ['бумагам',  'Д','м'],
        ['бумагу',  'В','е'], ['бумаги',   'В','м'],
        ['бумагой', 'Т','е'], ['бумагами', 'Т','м'],
        ['бумаге',  'П','е'], ['бумагах',  'П','м'],
        ]);
    //----------
    Существительное('пергамент','М',[
        ['пергамент',   'И','е'], ['пергаменты',   'И','м'],
        ['пергамента',  'Р','е'], ['пергаментов',  'Р','м'],
        ['пергаменту',  'Д','е'], ['пергаментам',  'Д','м'],
        ['пергамент',   'В','е'], ['пергаменты',   'В','м'],
        ['пергаментом', 'Т','е'], ['пергаментами', 'Т','м'],
        ['пергаменте',  'П','е'], ['пергаментах',  'П','м'],
        ]);
    //----------
    Существительное('письмо','С',[
        ['письмо',  'И','е'], ['письма',   'И','м'],
        ['письма',  'Р','е'], ['писем',    'Р','м'],
        ['письму',  'Д','е'], ['письмам',  'Д','м'],
        ['письмо',  'В','е'], ['письма',   'В','м'],
        ['письмом', 'Т','е'], ['письмами', 'Т','м'],
        ['письме',  'П','е'], ['письмах',  'П','м'],
        ]);
    //----------
    Существительное('карта','Ж',[
        ['карта',  'И','е'], ['карты',   'И','м'],
        ['карты',  'Р','е'], ['карт',    'Р','м'],
        ['карте',  'Д','е'], ['картам',  'Д','м'],
        ['карту',  'В','е'], ['карты',   'В','м'],
        ['картой', 'Т','е'], ['картами', 'Т','м'],
        ['карте',  'П','е'], ['картах',  'П','м'],
        ]);
    //----------
    Существительное('внимание','С',[
        ['внимание',  'И','е'],
        ['внимания',  'Р','е'],
        ['вниманию',  'Д','е'],
        ['внимание',  'В','е'],
        ['вниманием', 'Т','е'],
        ['внимании',  'П','е']
        ]);
    //----------
    Существительное('громила','М',[
        ['громила',  'И','е'], ['громилы',   'И','м'],
        ['громилы',  'Р','е'], ['громил',    'Р','м'],
        ['громиле',  'Д','е'], ['громилам',  'Д','м'],
        ['громилу',  'В','е'], ['громил',    'В','м'],
        ['громилой', 'Т','е'], ['громилами', 'Т','м'],
        ['громиле',  'П','е'], ['громилах',  'П','м'],
        ]);
    //----------
    Существительное('лодка','Ж',[
        ['лодка',  'И','е'], ['лодки',   'И','м'],
        ['лодки',  'Р','е'], ['лодок',   'Р','м'],
        ['лодке',  'Д','е'], ['лодкам',  'Д','м'],
        ['лодку',  'В','е'], ['лодки',   'В','м'],
        ['лодкой', 'Т','е'], ['лодками', 'Т','м'],
        ['лодке',  'П','е'], ['лодках',  'П','м'],
        //----------
        ['шлюпка',  'И','е'], ['шлюпки',   'И','м'],
        ['шлюпки',  'Р','е'], ['шлюпок',    'Р','м'],
        ['шлюпке',  'Д','е'], ['шлюпке',  'Д','м'],
        ['шлюпку',  'В','е'], ['шлюпку',   'В','м'],
        ['шлюпкой', 'Т','е'], ['шлюпкой', 'Т','м'],
        ['шлюпке',  'П','е'], ['шлюпке',  'П','м'],
        ]);
    //----------
    Существительное('север','М',[
        ['север',   'И','е'],
        ['севера',  'Р','е'],
        ['северу',  'Д','е'],
        ['север',   'В','е'],
        ['севером', 'Т','е'],
        ['севере',  'П','е']
        ]);
    //----------
    Существительное('юг','М',[
        ['юг',   'И','е'], ['юга',   'И','м'],
        ['юга',  'Р','е'], ['югов',  'Р','м'],
        ['югу',  'Д','е'], ['югам',  'Д','м'],
        ['юг',   'В','е'], ['юга',   'В','м'],
        ['югом', 'Т','е'], ['югами', 'Т','м'],
        ['юге',  'П','е'], ['югах',  'П','м'],
        ]);
    //----------
    Существительное('запад','М',[
        ['запад',   'И','е'],
        ['запада',  'Р','е'],
        ['западу',  'Д','е'],
        ['запад',   'В','е'],
        ['западом', 'Т','е'],
        ['западе',  'П','е']
        ]);
    //----------
    Существительное('восток','М',[
        ['восток',   'И','е'],
        ['востока',  'Р','е'],
        ['востоку',  'Д','е'],
        ['восток',   'В','е'],
        ['востоком', 'Т','е'],
        ['востоке',  'П','е']
        ]);
    //----------
    Существительное('петля','Ж',[
        ['петля',  'И','е'], //['петли',   'И','м'],
        ['петли',  'Р','е'], //['петель',  'Р','м'],
        ['петле',  'Д','е'], //['петлям',  'Д','м'],
        ['петлю',  'В','е'], //['петли',   'В','м'],
        ['петлёй', 'Т','е'], //['петлями', 'Т','м'],
        ['петле',  'П','е'], //['петлях',  'П','м'],
        //----------
        ['петлей-', 'Т','е'],
        ]);
    //----------
    Существительное('узел','М',[
        ['узел',  'И','е'], //['узлы',   'И','м'],
        ['узла',  'Р','е'], //['узлов',  'Р','м'],
        ['узлу',  'Д','е'], //['узлу',   'Д','м'],
        ['узел',  'В','е'], //['узлы',   'В','м'],
        ['узлом', 'Т','е'], //['узлами', 'Т','м'],
        ['узле',  'П','е'], //['узлах',  'П','м'],
        ]);
    //----------
    
/* --------------------------------------------------------------------------- */
// ГЛАГОЛЫ
    //----------
    Глагол('сделать',
        //----------
        ['делать+', 'сделать+', 'делай', 'сделай', 'соорудить+', 'сооруди' ],
        //----------
        [ [null, 'В'] ],
        [ null, 'в', 'вне', 'за', 'к', 'между', 'на', 'перед', 'под', 'с', '#где' ]
        );
    //----------
    Глагол('завязать',
        //----------
        ['завязать+', 'связать+', 'завяжи', 'свяжи', 'скрутить+', 'скрути', 'свернуть+', 'сверни' ],
        //----------
        [ [null, 'В'] ],
        [ null, 'в', 'вне', 'за', 'к', 'между', 'на', 'перед', 'под', 'с', '#где' ]
        );
    //----------
    Глагол('бросать', // +++ доработать
        //----------
        ['бросать+', 'бросить+', 'кинуть+', 'швырнуть+', 'метать+',
         'брось',    'кинь',    'швырни',    'метни',
         'бросай',   'кидать',  'швыряй',    'метай',
                     'кидай',
         ],
        //----------
        [ [null, 'В'] ],
        [ null, 'в', 'вне', 'за', 'к', 'между', 'на', 'перед', 'под', 'с', '#где', '#куда' ]
        );
    //----------
    Глагол('набрасывать',
        //----------
        ['набрасывать+', 'набросить+', 'накинуть+', 'набрось', 'накинь', 'набрасывай', 'накидывай' ],
        //----------
        [ [null, 'В'] ],
        [ null, ['на','В'] ]
        );
    //----------
    Глагол('взять',
        //----------
        ['взять+', 'подобрать+', 'брать+',
         'возьми', 'подбери',    'бери',
         ],
        //----------
        [ [null, 'В'] ],
        [ null, 'в', 'взамен', 'вне', 'за', 'из', 'из-за', 'из-под', 'к', 'между', 'на', 'над', 'перед', 'под', 'с', 'у', 'через', '#где', '#куда' ]
        );
    //----------
    Глагол('вытащить',
        //----------
        ['вытащить+', 'вытащи', 'вытаскивать', 'вытаскивай', 'тащить', 'тащи', 'вытянуть+', 'вытяни', 'тянуть', 'тяни', 'вынуть', 'вынь'],
        //----------
        [ [null,'В'] ],
        [ 'из', 'из-за', 'из-под', ['с','Р'] ],
        [ [null, 'Т'], ['за','В'] ]
        );
    //----------
    Глагол('достать',
        //----------
        ['достать+', 'достань'],
        //----------
        [ [null, 'В'] ],
        [ 'в', ['за', 'Т'], 'из', 'из-за', 'из-под', 'между', 'над', 'перед', 'под', 'с', 'у', 'через', '#откуда' ],
        [ [null, 'Т'] ]
        );
    //----------
    Глагол('поднять',
        //----------
        ['поднять+', 'подними', 'поднимай', 'подымать'],
        //----------
        [ null, [null, 'В'] ],
        [ 'из' ],
        [ null, [null, 'Т'], ['за','В'] ]
        );
    //----------
    Глагол('выйти',
        //----------
        ['выйти+',  'выходить+',
         'выйди',   'выходи',   ],
        //----------
        [ null, 'в', 'вне', 'до', 'за', 'из', 'из-за', 'из-под', 'к', 'между', 'на', 'от', 'перед', 'по', 'под', 'с', 'через', '#где', '#куда' ]
        );
    //----------
    Глагол('высыпать',
        //----------
        ['высыпать+',
         'высыпи',],
        //----------
        [ [null, 'В'] ],
        [ 'в', ['за', 'Т'], 'из', 'из-за', 'из-под', 'между', 'над', 'перед', 'под', 'с', 'у', 'через', '#откуда' ]
        [ [null, 'Т'] ]
        );
    //----------
    Глагол('кто',
        //----------
        ['кто+', 'что+'],
        //----------
        [ null, 'такой', [null, 'И'], ['за','И']]
        );
    //----------
    Глагол('идти',
        //----------
        ['идти+', 'ступать', 'проходить', 'подойти',
         'иди',   'ступай',  'пройди',    'подойди'],
        //----------
        [ null, 'в', 'вне', 'до', 'за', 'из', 'из-за', 'из-под', 'к', 'между', 'на', 'от', 'перед', 'по', 'под', 'с', 'через', '#где', '#куда' ]
        );
    //----------
    Глагол('вернуться',
        //----------
        ['вернуться+', 'возвращаться', 'вернись', 'возвращайся'],
        //----------
        [ null, 'в', 'вне', 'до', 'за', 'из', 'из-за', 'из-под', 'к', 'между', 'на', 'от', 'перед', 'по', 'под', 'с', 'через', '#где', '#куда' ]
        );
    //----------
    
    Глагол('искать',
        //----------
        ['искать+', 'найти+',   'поискать+',    'пошарить',
         'ищи',     'найди',    'поищи',        'пошарь'],
        //----------
        [ [null, 'В'] ],
        [ 'в', 'вне', 'за', 'между', 'на', 'над', 'перед', 'под', 'у', 'через', '#где' ],
        [ [null, 'Т'] ]
        );
    //----------
    Глагол('положить',
        //----------
        ['положить+', 'класть', 'поместить+', 'уложить', 'разложить',// 'возложить',
         'положи',    'клади',  'помести',    'уложи',   'разложи',//    'возложи',
         'положь',],
        //----------
        [ [null, 'В'] ],
        [ null, 'в', 'вне', 'за', 'к', 'между', 'на', 'перед', 'под', 'с', '#где', '#куда' ]
        );
    //----------
    Глагол('вставить',
        //----------
        ['вставить+', 'вставь', 'вставлять', 'вставляй', 'засунуть+', 'засунь', 'запихнуть+', 'запихни',],
        //----------
        [ [null, 'В'] ],
        [ null, ['в','В'], 'вне', 'за', 'к', 'между', 'на', 'перед', 'под', 'с', '#где', '#куда' ]
        );
    //----------
    Глагол('насыпать',
        //----------
        ['сыпать+', 'сыпь', 'насыпать+', 'насыпь', 'засыпать', 'засыпь', 'высыпать', 'высыпь'],
        //----------
        [ [null, 'В'] ],
        [ null, ['в','В'], 'вне', 'за', 'к', 'между', 'на', 'перед', 'под', 'с', '#куда' ]
        );
    //----------
    Глагол('привязать',
        ['привязать+',  'прикрутить',   'привязаться+',
         'привяжи',     'прикрути',     'привяжись'],
        [ null, [null,'В'] ],
        //[ 'в', 'вне', 'к', 'между', 'над', 'перед', 'под', 'с', 'у', '#куда', '#где' ],
        //[ 'к', 'между', 'над', 'перед', 'под', 'с', 'у', '#куда', '#где' ],
        [ ['за','Т'], 'к', 'между', 'над', 'перед', ['под','Т'], 'с', 'у' ],
        //[ 'к' ],
        [ [null,'Т'], ['за','В'] ]
        );
    //----------
    Глагол('разобрать',
        ['разобрать+', 'разбери', 'раскрутить+', 'раскрути'],
        [ null, [null,'В'] ],
        [ [null,'Т'], ['за','В'] ]
        );
    //----------
    Глагол('сломать',
        ['ломать+', 'ломай', 'сломать+', 'сломай', 'разломать+', 'разломай', 'взломать+', 'взломай'],
        [ null, [null,'В'] ],
        [ [null,'Т'], ['за','В'], 'о' ]
        );
    //----------
    Глагол('жечь',
        ['сжечь+', 'сожги', 'поджечь+', 'подожги', 'жечь+', 'жги', 'запалить+', 'запали', 'зажечь+', 'зажги'],
        [ null, [null,'В'] ],
        [ [null,'Т'] ]
        );
    //----------
    Глагол('осмотреть',
        //----------
        ['осмотреть+',  'заглянуть+',   'посмотреть+',  'поглядеть',    'смотреть+', 'выглянуть+',
         'осм',         'загляни',      'посмотри',     'погляди',      'смотри',   'выгляни',
         'осмотри',
         'осмотреться+', 'осмотрись', 'осмотрется',
         'рассмотреть+', 'рассмотри', 'разглядеть', 'разгляди', 
        ],
        //----------
        [ null, [null,'В'], '#куда' ],
        [ 'в', ['за','Т'], 'из', 'из-за', 'из-под', 'между', 'на', 'над', 'перед', 'по', 'под', 'с', 'у', 'через', '#где' ]
        );
    //----------
    Глагол('читать',
        //----------
        ['читать+', 'читай', 'прочесть+', 'прочти', 'прочитать+', 'прочитай', 'зачитать+', 'зачитай' ],
        //----------
        [ null, [null,'В'] ]
        );
    //----------
    Глагол('изучить',
        //----------
        [ 'изучить+', 'изучи', 'исследовать+', 'исследуй' ],
        //----------
        [ null, [null,'В'], '#куда' ],
        [ 'в', ['за','Т'], 'из', 'из-за', 'из-под', 'между', 'на', 'над', 'перед', 'по', 'под', 'с', 'у', 'через', '#где' ]
        );
    //----------
    Глагол('сесть',
        //----------
        ['сесть+', 'садись', 'сядь', 'присесть+', 'присядь', 'присаживайся', 'усаживайся'],
        //----------
        [ 'в', ['за', 'Т'], 'между', 'на', 'над', 'перед', 'под', 'у' ] //, '#где'
        );
    //----------
    Глагол('лечь',
        //----------
        ['лечь+', 'прилечь+', 'ложись', 'приляг', 'уложись', 'укладывайся'],
        //----------
        [ 'в', ['за', 'Т'], 'между', 'на', 'над', 'перед', 'под', 'у' ] //, '#где'
        );
    //----------
    Глагол('устроиться',
        //----------
        ['устроиться+', 'устройся', 'устраивайся'],
        //----------
        [ 'в', ['за', 'Т'], 'между', 'на', 'над', 'перед', 'под', 'у' ] //, '#где'
        );
    //----------
    Глагол('выстрелить',
        //----------
        ['выстрелить+', 'выстрели', 'стрелять+', 'стреляй', 'пальнуть+', 'пальни', 'пострелять+', 'постреляй'],
        //----------
        [ ['в','В'], 'по', ['под','В'] ],
        [ 'из' ],
        [ 'из-за', 'из-под', 'через' ]
        );
    //----------
    Глагол('махать',
        //----------
        ['махать+', 'маши', 'помахать+', 'помаши'],
        //----------
        [ [null,'Д'] ],
        [ [null,'Т'] ]
        );
    //----------
    Глагол('сигналить',
        //----------
        ['сигналить+', 'сигналь', 'посигналить+', 'посигналь', 'просигналить+', 'просигналь'],
        //----------
        [ [null,'Д'] ],
        [ [null,'Т'], 'из' ]
        );
    //----------
    Глагол('срубить',
        //----------
        ['срубить+', 'сруби', 'рубить+', 'руби', 'свалить', 'свали', 'валить', 'вали'],
        //----------
        [ [null,'В'] ],
        [ [null,'Т'], 'из' ]
        );
    //----------
    Глагол('прятаться',
        //----------
        ['прятаться+', 'прячься', 'спрятаться+', 'спрячься', 'скрыться', 'скройся'],
        //----------
        [ 'в', ['за', 'Т'], 'между', 'на', 'над', 'перед', 'от', 'под', 'у' ] //, '#где'
        );
    //----------
    Глагол('встать',
        //----------
        ['встать+', 'встань', 'вставать', 'вставай'],
        //----------
        [ 'в', 'вне', ['за', 'Т'], 'к', 'между', 'на', 'над', 'перед', 'под', ['с', 'Р'], 'у' ] //, '#где'
        );
    //----------
    Глагол('подняться',
        //----------
        ['подняться+', 'поднимайся'],
        //----------
        [ 'в', 'вне', ['за', 'Т'], 'к', 'между', 'на', 'над', 'перед', 'по', 'под', ['с', 'Р'], 'у' ] //, '#где'
        );
    //----------
    Глагол('копать',
        //----------
        ['копать+', 'копай', 'рыть', 'рой'],
        //----------
        [ null, [null, 'В'] ],
        [ 'в', ['за', 'Т'], 'между', 'перед', ['под', 'Т'], 'у' ], //, '#где'
        [ null, [null, 'Т'] ]
        );
    //----------
    Глагол('открыть',
        //----------
        ['открыть+', 'открывай', 'вскрыть+', 'вскрой', 'вскрывай'],
        //----------
        [ null, [null, 'В'] ],
        [ null, [null, 'Т'], [null,'Р'] ]
        );
    //----------
    Глагол('резать',
        //----------
        ['резать+', 'отрезать+', 'режь', 'отрежь', 'отхватить', 'отхватывать', 'отхватывай', 'отхвати'],
        //----------
        [ [null,'В'] ],
        [ [null,'Р'], 'от', ['с','Р'], 'у' ],
        [ [null,'Т'] ]
        );
    //----------
    Глагол('плыть',
        //----------
        ['плыть+', 'поплыть+', 'плыви', 'поплыви', 'доплыть', 'доплыви'],
        //----------
        [ 'в', 'до', 'к', ['на','В'], 'от', 'через' ],
        [ ['на','Т'] ]
        );
    //----------
    Глагол('показать',
        //----------
        ['показать+', 'покажи', 'продемонстрировать+', 'продемонстрируй'],
        //----------
        [ [null,'В'] ],
        [ [null,'Д'] ]
        );
    //----------
    Глагол('привлечь',
        //----------
        ['привлечь+', 'привлеки', 'поманить+', 'помани', 'манить+', 'мани', 'приманить+', 'примани'],
        //----------
        [ [null,'В'] ],
        [ [null,'Т'] ],
        [ [null,'Р'] ]
        );
    //----------
    Глагол('думать',
        //----------
        ['думать+', 'думай', 'обдумать+', 'обдумай', 'подумать+', 'подумай'],
        //----------
        [ [null,'В'], ['о','П'], 'про']
        );
    //----------
    Глагол('лезть',
        //----------
        ['лезть+', 'лезь', 'лазь',
         'залезть+', 'залазить', 'залезай', 'залазь',
         'влезть+', 'влезь', 'влазь', 'влазить+', 'влезай', 'влазь'],
        //----------
        [ null, 'в', 'за', 'к', 'между', ['на','В'], 'под', 'через', '#куда' ],
        [ null, [null,'Р'] ]
        );
    //----------
    Глагол('карабкаться',
        //----------
        ['карабкаться+', 'карабкайся', 'вскарабкаться+', 'вскарабкайся', 'вскарабкиваться', 'вскарабкивайся'],
        //----------
        [ null, 'в', 'вне', 'до', 'за', 'из', 'из-за', 'из-под', 'к', 'между', 'на', 'от', 'перед', 'по', 'под', 'с', 'через', '#где', '#куда' ],
        [ null, [null,'Р'] ]
        );
    //----------


    
/* --------------------------------------------------------------------------- */
